# 5) Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор
# натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если
# в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же
# значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3,
# 3, 2]

my_list = [7, 5, 3, 3, 2]
print(my_list)
new_rate = input('Введите новый элемент рейтинга (1-9): ')
while not new_rate.isdigit() or not 0 < int(new_rate) < 10:
    new_rate = input("Это не число, или оно не в диапазоне 1-9, попробуйте еще раз: ")
new_rate = int(new_rate)
if new_rate <= my_list[-1]:
    my_list.append(new_rate)
else:
    for i in range(len(my_list)):
        if my_list[i] < new_rate:
            my_list.insert(i, new_rate)
            break
print(my_list)
