# PEP8


# """int - это целое число
# float - это дробное число
# str - это строка
# bool - boolean всего 2 значения истина = true лож = false
# """
#
# catalog_id_1 = 14
# catalog_id_2 = 15
# my_float = 12.123
# my_str1 = 'Это строка 1'
# my_str2 = "Это тоже строка 2"
# my_str3 = """это строка и
# множества
# строк"""
#
#
# my_str4 = 'Нужно выделить "ТЕРМИН"'
# my_str5 = "Нужно выжедить \"ТЕРМИН\""
#
#
# age = input('ВВедите возраст: ')
#
# # if age.isdigit():
# #     age = int(age)
# #     if age >= 18:
# #          print("Доступ разрешен")
# #     elif age >= 16:
# #          print("Ограниенный доступ")
# #     else:
# #          print("Доступ запрещен")
# # else:
# #     print("Возраст должен быть числом")

