# 6) Спортсмен занимается ежедневными пробежками. В первый день его результат составил a
# километров. Каждый день спортсмен увеличивал результат на 10 % относительно
# предыдущего. Требуется определить номер дня, на который результат спортсмена составит
# не менее b километров. Программа должна принимать значения параметров a и b и выводить
# одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# © geekbrains.ru 32
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

user_a = int(input("Введите результаты пробежки первого дня в км\n"))
user_b = int(input("Введите до скольки вы хотите увеличить дальность пробежки в км\n"))
result_day = 1
while  user_b - user_a >= 0:
       user_a *= 1.1
       result_day += 1

print(f"Вы достигнете требуемых показателей на %.d день" % result_day)